<h1 align=center><font size = 6>Connecting to Databases via IPython Enviroment</font></h1>

This notebook is an exercise in connecting to and working with a SQL database within an IPython enviroment. This is achieved in two approaches: 

* IPython SQl Magic Extension 
* SQLAlchemy 

I demonstrate how to complete create, read, update and delete (CRUD) operations with the database as well as import a large a dataset from a CSV file.

### **Connecting to IBM DB2 Database**

To start, establish connectioin with the database that will be used throughout this notebook. [IBM DB2](https://cloud.ibm.com/services/dashdb-for-transactions/crn%3Av1%3Abluemix%3Apublic%3Adashdb-for-transactions%3Aus-south%3Aa%2F69a36a60aa3e4d0d99559669772442c0%3A35fa5e20-0495-4672-a7f2-61727118ffdc%3A%3A?paneId=gettingStarted) on Cloud is an SQL database provisioned in the cloud.

In [ ]:
!pip install ibm_db_sa

In [2]:
#Load IPython SQL Magic extension to write SQL queries directly into cell
%load_ext sql

In [45]:
#Connect to personal IBM Db2 account using connection string URI
%sql ibm_db_sa://[username]:[password]@[hostname]/[database]

'Connected: bvf50403@BLUDB'

In [47]:
#Create new table
%sql create table WRITER(ID INT NOT NULL, first_name VARCHAR(20) NOT NULL, last_name VARCHAR(20) NOT NULL, year_of_death INT, PRIMARY KEY (ID))

 * ibm_db_sa://bvf50403:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net/BLUDB
Done.

[]

In [48]:
#Update: Insert values into table 
%sql insert into WRITER values(1, 'William', 'Shakespeare', 1616), (2, 'Bertold', 'Brecht', 1956), (3, 'Charles','Dickens', 1812)

 * ibm_db_sa://bvf50403:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net/BLUDB
3 rows affected.

[]

In [49]:
#Read values from WRITER table
%sql select * from WRITER

 * ibm_db_sa://bvf50403:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net/BLUDB
Done.

[(1, 'William', 'Shakespeare', 1616),
 (2, 'Bertold', 'Brecht', 1956),
 (3, 'Charles', 'Dickens', 1812)]

In [50]:
#Delete WRITER table
%sql drop table WRITER

 * ibm_db_sa://bvf50403:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net/BLUDB
Done.

[]

### **Using SQLAlchemy**

[SQLAlchemy](https://www.sqlalchemy.org/) is a Python SQL toolkit and Object Relational Mapper (ORM) that gives applicaiton developers efficient and high-performing database access in a Pythonic domain language. 
    

**Resources for SQLAlchemy**:
* [Introductory Tutorial of Python’s SQLAlchemy](https://www.pythoncentral.io/introductory-tutorial-python-sqlalchemy/)
*[Connecting to remote MySql instance with Google Co-lab](https://stackoverflow.com/questions/58201910/connecting-to-remote-mysql-instance-with-google-co-lab)
*[Beginners Guide to SQLAlchemy](https://analyticsindiamag.com/beginners-guide-to-sqlalchemy-in-python-for-database-operations/)
*[SQLAlchemy Basics Tutorial](https://leportella.com/sqlalchemy-tutorial.html)
*[SQL Expression Language Tutorial](https://docs.sqlalchemy.org/en/13/core/tutorial.html) 
*[SQLAlchemy — Python Tutorial](https://towardsdatascience.com/sqlalchemy-python-tutorial-79a577141a91)

In [11]:
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy import Table, Column, String, Integer, ForeignKey
from sqlalchemy.orm import sessionmaker
from sqlalchemy import MetaData
from sqlalchemy.ext.declarative import declarative_base

In [12]:
#SQLAlchemy engine works to interpret the DBAPI's moldule and behavior of the DB
engine = create_engine('ibm_db_sa://bvf50403:k9c3hv1ngs@gk650@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net/BLUDB', echo=True)

In [13]:
#MetaData is a container obj that keeps tracks different features of a DB
meta = MetaData()

In [ ]:
#Create Table
beatles = Table(
   'beatles', meta, 
   Column('id', Integer, primary_key = True), 
   Column('name', String(20)), 
   Column('lastname', String(20)),
   extend_existing=True,
)

meta.create_all(engine)
print("Columns in table %s" %(beatles.columns.keys()))

2020-08-04 22:05:27,848 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."TABLES"."TABNAME"
FROM "SYSCAT"."TABLES"
WHERE "SYSCAT"."TABLES"."TABSCHEMA" = ? AND "SYSCAT"."TABLES"."TABNAME" = ?
2020-08-04 22:05:27,849 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'STUDENTS')
2020-08-04 22:05:28,209 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."TABLES"."TABNAME"
FROM "SYSCAT"."TABLES"
WHERE "SYSCAT"."TABLES"."TABSCHEMA" = ? AND "SYSCAT"."TABLES"."TABNAME" = ?
2020-08-04 22:05:28,211 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'BEATLES')
2020-08-04 22:05:28,571 INFO sqlalchemy.engine.base.Engine
CREATE TABLE students (
	id INT NOT NULL GENERATED BY DEFAULT AS IDENTITY (START WITH 1),
	name VARCHAR(20),
	lastname VARCHAR(20),
	PRIMARY KEY (id)
)


2020-08-04 22:05:28,572 INFO sqlalchemy.engine.base.Engine ()
2020-08-04 22:05:28,904 INFO sqlalchemy.engine.base.Engine COMMIT
2020-08-04 22:05:29,089 INFO sqlalchemy.engine.base.Engine
CREATE TABLE beatles (
	id INT NOT NULL GENERATED BY DEFAULT AS IDENTITY (START WITH 1),
	name VARCHAR(20),
	lastname VARCHAR(20),
	PRIMARY KEY (id)
)


2020-08-04 22:05:29,090 INFO sqlalchemy.engine.base.Engine ()
2020-08-04 22:05:29,418 INFO sqlalchemy.engine.base.Engine COMMIT
Columns in table ['id', 'name', 'lastname']

In [ ]:
#Insert new values into table 
engine.connect().execute(beatles.insert(), [{'name': 'Paul', 'lastname': 'McCartney'},
                                            {'name': 'John', 'lastname': 'Lennon'},
                                            {'name':'George', 'lastname':'Harrison'},
                                            {'name':'Pete', 'lastname':'Best'},
])

2020-08-04 22:05:34,360 INFO sqlalchemy.engine.base.Engine INSERT INTO beatles (name, lastname) VALUES (?, ?)
2020-08-04 22:05:34,362 INFO sqlalchemy.engine.base.Engine (('Paul', 'McCartney'), ('John', 'Lennon'), ('George', 'Harrison'), ('Pete', 'Best'))
2020-08-04 22:05:34,914 INFO sqlalchemy.engine.base.Engine COMMIT

In [ ]:
#Retrieve data
engine.connect().execute(beatles.select()).fetchall()

2020-08-04 22:05:43,884 INFO sqlalchemy.engine.base.Engine SELECT beatles.id, beatles.name, beatles.lastname
FROM beatles
2020-08-04 22:05:43,885 INFO sqlalchemy.engine.base.Engine ()

[(1, 'Paul', 'McCartney'),
 (2, 'John', 'Lennon'),
 (3, 'George', 'Harrison'),
 (4, 'Pete', 'Best')]

In [ ]:
#Update table
update= beatles.update().where(beatles.c.name=='Pete').values(name='Ringo', lastname='Starr')
engine.connect().execute(update)
engine.connect().execute(beatles.select()).fetchall()

2020-08-04 22:05:47,188 INFO sqlalchemy.engine.base.Engine UPDATE beatles SET name=?, lastname=? WHERE beatles.name = ?
2020-08-04 22:05:47,189 INFO sqlalchemy.engine.base.Engine ('Ringo', 'Starr', 'Pete')
2020-08-04 22:05:47,561 INFO sqlalchemy.engine.base.Engine COMMIT
2020-08-04 22:05:47,922 INFO sqlalchemy.engine.base.Engine SELECT beatles.id, beatles.name, beatles.lastname
FROM beatles
2020-08-04 22:05:47,923 INFO sqlalchemy.engine.base.Engine ()

[(1, 'Paul', 'McCartney'),
 (2, 'John', 'Lennon'),
 (3, 'George', 'Harrison'),
 (4, 'Ringo', 'Starr')]

In [ ]:
#Convert table to Pandas data frame -- just to show flexibility of handling data 
import pandas as pd
ResultSet = engine.connect().execute(beatles.select()).fetchall() 
df = pd.DataFrame(ResultSet)
df.head()

2020-08-04 22:07:38,731 INFO sqlalchemy.engine.base.Engine SELECT beatles.id, beatles.name, beatles.lastname
FROM beatles
2020-08-04 22:07:38,735 INFO sqlalchemy.engine.base.Engine ()

   0       1          2
0  1    Paul  McCartney
1  2    John     Lennon
2  3  George   Harrison
3  4   Ringo      Starr

In [ ]:
#Delete table 
beatles.drop(engine)

2020-08-04 22:07:56,253 INFO sqlalchemy.engine.base.Engine
DROP TABLE beatles
2020-08-04 22:07:56,254 INFO sqlalchemy.engine.base.Engine ()
2020-08-04 22:07:56,471 INFO sqlalchemy.engine.base.Engine COMMIT

### **Importing Large Data Set to Database Using SQLAlchemy**

In this step, a large dataset is imported to my connected database using SQLAlchemy and Pandas operations

**About the dataset**: This dataset consists of tv shows and movies available on Netflix as of 2019. The dataset is collected from Flixable which is a third-party Netflix search engine.

In [7]:
#Retrieve dataset
!wget -O netflix_titles.csv https://raw.githubusercontent.com/peraltae/databases/master/netflix_titles.csv

--2020-08-05 17:27:30--  https://raw.githubusercontent.com/peraltae/databases/master/netflix_titles.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 2410660 (2.3M) [text/plain]
Saving to: ‘netflix_titles.csv’

netflix_titles.csv  100%[===================>]   2.30M  14.3MB/s    in 0.2s

2020-08-05 17:27:30 (14.3 MB/s) - ‘netflix_titles.csv’ saved [2410660/2410660]

In [44]:
import pandas as pd
df = pd.read_csv('/content/netflix_titles.csv')
print('Shape:', df.shape)
df.head()

Shape: (6234, 12)

    show_id  ...                                        description
0  81145628  ...  Before planning an awesome wedding for his gra...
1  80117401  ...  Jandino Asporaat riffs on the challenges of ra...
2  70234439  ...  With the help of three human allies, the Autob...
3  80058654  ...  When a prison ship crash unleashes hundreds of...
4  80125979  ...  When nerdy high schooler Dani finally attracts...

[5 rows x 12 columns]

In [9]:
df.dtypes

show_id          int64
type            object
title           object
director        object
cast            object
country         object
date_added      object
release_year     int64
rating          object
duration        object
listed_in       object
description     object
dtype: object

In [33]:
#Create new MetaData object
metaNet = MetaData()

In [34]:
#Create table for incoming data
netflix_titles = Table('netflix_titles', metaNet,
                    Column('show_id', Integer, primary_key=True), 
                    Column('type', String(20)),
                    Column('title', String(20)),
                    Column('title', String(20)),
                    Column('director', String(20)),
                    Column('cast', String(200)),
                    Column('country', String(20)),
                    Column('date_added', Integer),
                    Column('release_year', Integer),
                    Column('rating', String(20)),
                    Column('duration', String(20)),
                    Column('listed_in', String(20)),
                    Column('description', String(200)),
  )

In [35]:
metaNet.create_all(engine)
print("Columns in table %s" %(netflix_titles.columns.keys()))

2020-08-05 17:53:25,760 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."TABLES"."TABNAME"
FROM "SYSCAT"."TABLES"
WHERE "SYSCAT"."TABLES"."TABSCHEMA" = ? AND "SYSCAT"."TABLES"."TABNAME" = ?
2020-08-05 17:53:25,762 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'NETFLIX_TITLES')
2020-08-05 17:53:25,835 INFO sqlalchemy.engine.base.Engine
CREATE TABLE netflix_titles (
	show_id INT NOT NULL GENERATED BY DEFAULT AS IDENTITY (START WITH 1),
	"type" VARCHAR(20),
	title VARCHAR(20),
	director VARCHAR(20),
	"cast" VARCHAR(200),
	country VARCHAR(20),
	date_added INT,
	release_year INT,
	rating VARCHAR(20),
	duration VARCHAR(20),
	listed_in VARCHAR(20),
	description VARCHAR(200),
	PRIMARY KEY (show_id)
)


2020-08-05 17:53:25,837 INFO sqlalchemy.engine.base.Engine ()
2020-08-05 17:53:26,026 INFO sqlalchemy.engine.base.Engine COMMIT
Columns in table ['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added', 'release_year', 'rating', 'duration', 'listed_in', 'description']

In [36]:
#Import CSV to database using Pandas
%time df.to_sql(con=engine, name='netflix_titles',if_exists='replace')

2020-08-05 17:53:40,089 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."TABLES"."TABNAME"
FROM "SYSCAT"."TABLES"
WHERE "SYSCAT"."TABLES"."TABSCHEMA" = ? AND "SYSCAT"."TABLES"."TABNAME" = ?
2020-08-05 17:53:40,091 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'NETFLIX_TITLES')
2020-08-05 17:53:40,200 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."TABLES"."TABNAME"
FROM "SYSCAT"."TABLES"
WHERE "SYSCAT"."TABLES"."TABSCHEMA" = ? AND "SYSCAT"."TABLES"."TABNAME" = ?
2020-08-05 17:53:40,201 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'NETFLIX_TITLES')
2020-08-05 17:53:40,310 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."TABLES"."TABNAME"
FROM "SYSCAT"."TABLES"
WHERE "SYSCAT"."TABLES"."TYPE" = ? AND "SYSCAT"."TABLES"."TABSCHEMA" = ? ORDER BY "SYSCAT"."TABLES"."TABNAME"
2020-08-05 17:53:40,311 INFO sqlalchemy.engine.base.Engine (b'T', b'BVF50403')
2020-08-05 17:53:40,387 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."COLUMNS"."COLNAME", "SYSCAT"."COLUMNS"."TYPENAME", "SYSCAT"."COLUMNS"."DEFAULT", "SYSCAT"."COLUMNS"."NULLS", "SYSCAT"."COLUMNS"."LENGTH", "SYSCAT"."COLUMNS"."SCALE", "SYSCAT"."COLUMNS"."IDENTITY", "SYSCAT"."COLUMNS"."GENERATED"
FROM "SYSCAT"."COLUMNS"
WHERE "SYSCAT"."COLUMNS"."TABSCHEMA" = ? AND "SYSCAT"."COLUMNS"."TABNAME" = ? ORDER BY "SYSCAT"."COLUMNS"."COLNO"
2020-08-05 17:53:40,388 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'NETFLIX_TITLES')
2020-08-05 17:53:40,498 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."INDEXES"."COLNAMES"
FROM "SYSCAT"."INDEXES"
WHERE "SYSCAT"."INDEXES"."TABSCHEMA" = ? AND "SYSCAT"."INDEXES"."TABNAME" = ? AND "SYSCAT"."INDEXES"."UNIQUERULE" = ? ORDER BY "SYSCAT"."INDEXES"."TABSCHEMA", "SYSCAT"."INDEXES"."TABNAME"
2020-08-05 17:53:40,499 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'NETFLIX_TITLES', b'P')
2020-08-05 17:53:40,598 INFO sqlalchemy.engine.base.Engine SELECT "SYSIBM"."SQLFOREIGNKEYS"."FK_NAME", "SYSIBM"."SQLFOREIGNKEYS"."FKTABLE_SCHEM", "SYSIBM"."SQLFOREIGNKEYS"."FKTABLE_NAME", "SYSIBM"."SQLFOREIGNKEYS"."FKCOLUMN_NAME", "SYSIBM"."SQLFOREIGNKEYS"."PK_NAME", "SYSIBM"."SQLFOREIGNKEYS"."PKTABLE_SCHEM", "SYSIBM"."SQLFOREIGNKEYS"."PKTABLE_NAME", "SYSIBM"."SQLFOREIGNKEYS"."PKCOLUMN_NAME"
FROM "SYSIBM"."SQLFOREIGNKEYS"
WHERE "SYSIBM"."SQLFOREIGNKEYS"."FKTABLE_SCHEM" = ? AND "SYSIBM"."SQLFOREIGNKEYS"."FKTABLE_NAME" = ? ORDER BY "SYSIBM"."SQLFOREIGNKEYS"."KEY_SEQ"
2020-08-05 17:53:40,599 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'NETFLIX_TITLES')
2020-08-05 17:53:40,743 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."INDEXES"."INDNAME", "SYSCAT"."INDEXES"."COLNAMES", "SYSCAT"."INDEXES"."UNIQUERULE", "SYSCAT"."INDEXES"."SYSTEM_REQUIRED"
FROM "SYSCAT"."INDEXES"
WHERE "SYSCAT"."INDEXES"."TABSCHEMA" = ? AND "SYSCAT"."INDEXES"."TABNAME" = ? ORDER BY "SYSCAT"."INDEXES"."TABNAME"
2020-08-05 17:53:40,744 INFO sqlalchemy.engine.base.Engine (b'BVF50403', b'NETFLIX_TITLES')
2020-08-05 17:53:40,817 INFO sqlalchemy.engine.base.Engine SELECT "SYSCAT"."KEYCOLUSE"."CONSTNAME", "SYSCAT"."KEYCOLUSE"."COLNAME"
FROM "SYSCAT"."KEYCOLUSE", "SYSCAT"."TABCONST"
WHERE "SYSCAT"."KEYCOLUSE"."CONSTNAME" = "SYSCAT"."TABCONST"."CONSTNAME" AND "SYSCAT"."TABCONST"."TABNAME" = ? AND "SYSCAT"."TABCONST"."TABSCHEMA" = ? AND "SYSCAT"."TABCONST"."TYPE" = ? ORDER BY "SYSCAT"."KEYCOLUSE"."CONSTNAME"
2020-08-05 17:53:40,818 INFO sqlalchemy.engine.base.Engine (b'NETFLIX_TITLES', b'BVF50403', b'U')
2020-08-05 17:53:40,927 INFO sqlalchemy.engine.base.Engine
DROP TABLE netflix_titles
2020-08-05 17:53:40,928 INFO sqlalchemy.engine.base.Engine ()
2020-08-05 17:53:41,001 INFO sqlalchemy.engine.base.Engine COMMIT
2020-08-05 17:53:41,096 INFO sqlalchemy.engine.base.Engine
CREATE TABLE netflix_titles (
	"index" BIGINT,
	show_id BIGINT,
	"type" CLOB,
	title CLOB,
	director CLOB,
	"cast" CLOB,
	country CLOB,
	date_added CLOB,
	release_year BIGINT,
	rating CLOB,
	duration CLOB,
	listed_in CLOB,
	description CLOB
)


2020-08-05 17:53:41,097 INFO sqlalchemy.engine.base.Engine ()
2020-08-05 17:53:41,300 INFO sqlalchemy.engine.base.Engine COMMIT
2020-08-05 17:53:41,346 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_netflix_titles_index ON netflix_titles ("index")
2020-08-05 17:53:41,347 INFO sqlalchemy.engine.base.Engine ()
2020-08-05 17:53:41,469 INFO sqlalchemy.engine.base.Engine COMMIT
2020-08-05 17:53:41,553 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-08-05 17:53:41,618 INFO sqlalchemy.engine.base.Engine INSERT INTO netflix_titles ("index", show_id, "type", title, director, "cast", country, date_added, release_year, rating, duration, listed_in, description) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2020-08-05 17:53:41,619 INFO sqlalchemy.engine.base.Engine ((0, 81145628, 'Movie', 'Norm of the North: King Sized Adventure', 'Richard Finn, Tim Maltby', 'Alan Marriott, Andrew Toth, Brian Dobson, Cole Howard, Jennifer Cameron, Jonathan Holmes, Lee Tockar, Lisa Durupt, Maya Kay, Michael Dobson', 'United States, India, South Korea, China', 'September 9, 2019', 2019, 'TV-PG', '90 min', 'Children & Family Movies, Comedies', 'Before planning an awesome wedding for his grandfather, a polar bear king must take back a stolen artifact from an evil archaeologist first.'), (1, 80117401, 'Movie', 'Jandino: Whatever it Takes', None, 'Jandino Asporaat', 'United Kingdom', 'September 9, 2016', 2016, 'TV-MA', '94 min', 'Stand-Up Comedy', 'Jandino Asporaat riffs on the challenges of raising kids and serenades the audience with a rousing rendition of "Sex on Fire" in his comedy show.'), (2, 70234439, 'TV Show', 'Transformers Prime', None, 'Peter Cullen, Sumalee Montano, Frank Welker, Jeffrey Combs, Kevin Michael Richardson, Tania Gunadi, Josh Keaton, Steve Blum, Andy Pessoa, Ernie Hudson, Daran Norris, Will Friedle', 'United States', 'September 8, 2018', 2013, 'TV-Y7-FV', '1 Season', "Kids' TV", 'With the help of three human allies, the Autobots once again protect Earth from the onslaught of the Decepticons and their leader, Megatron.'), (3, 80058654, 'TV Show', 'Transformers: Robots in Disguise', None, 'Will Friedle, Darren Criss, Constance Zimmer, Khary Payton, Mitchell Whitfield, Stuart Allan, Ted McGinley, Peter Cullen', 'United States', 'September 8, 2018', 2016, 'TV-Y7', '1 Season', "Kids' TV", 'When a prison ship crash unleashes hundreds of Decepticons on Earth, Bumblebee leads a new Autobot force to protect humankind.'), (4, 80125979, 'Movie', '#realityhigh', 'Fernando Lebrija', 'Nesta Cooper, Kate Walsh, John Michael Higgins, Keith Powers, Alicia Sanz, Jake Borelli, Kid Ink, Yousef Erakat, Rebekah Graf, Anne Winters, Peter Gilroy, Patrick Davis', 'United States', 'September 8, 2017', 2017, 'TV-14', '99 min', 'Comedies', 'When nerdy high schooler Dani finally attracts the interest of her longtime crush, she lands in the cross hairs of his ex, a social media celebrity.'), (5, 80163890, 'TV Show', 'Apaches', None, 'Alberto Ammann, Eloy Azorín, Verónica Echegui, Lucía Jiménez, Claudia Traisac', 'Spain', 'September 8, 2017', 2016, 'TV-MA', '1 Season', 'Crime TV Shows, International TV Shows, Spanish-Language TV Shows', 'A young journalist is forced into a life of crime to save his father and family in this series based on the novel by Miguel Sáez Carral.'), (6, 70304989, 'Movie', 'Automata', 'Gabe Ibáñez', 'Antonio Banderas, Dylan McDermott, Melanie Griffith, Birgitte Hjort Sørensen, Robert Forster, Christa Campbell, Tim McInnerny, Andy Nyman, David Ryall', 'Bulgaria, United States, Spain, Canada', 'September 8, 2017', 2014, 'R', '110 min', 'International Movies, Sci-Fi & Fantasy, Thrillers', 'In a dystopian future, an insurance adjuster for a tech company investigates a robot killed for violating protocol and discovers a global conspiracy.'), (7, 80164077, 'Movie', 'Fabrizio Copano: Solo pienso en mi', 'Rodrigo Toro, Francisco Schultz', 'Fabrizio Copano', 'Chile', 'September 8, 2017', 2017, 'TV-MA', '60 min', 'Stand-Up Comedy', 'Fabrizio Copano takes audience participation to the next level in this stand-up set while reflecting on sperm banks, family WhatsApp groups and more.')  ... displaying 10 of 6234 total bound parameter sets ...  (6232, 70281022, 'TV Show', "A Young Doctor's Notebook and Other Stories", None, 'Daniel Radcliffe, Jon Hamm, Adam Godley, Christopher Godwin, Rosie Cavaliero, Vicki Pepperdine, Margaret Clunie, Tim Steed, Shaun Pye', 'United Kingdom', None, 2013, 'TV-MA', '2 Seasons', 'British TV Shows, TV Comedies, TV Dramas', "Set during the Russian Revolution, this comic miniseries is based on a doctor's memories of his early career working in an out-of-the-way village."), (6233, 70153404, 'TV Show', 'Friends', None, 'Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry, David Schwimmer', 'United States', None, 2003, 'TV-14', '10 Seasons', 'Classic & Cult TV, TV Comedies', 'This hit sitcom follows the merry misadventures of six 20-something pals as they navigate the pitfalls of work, life and love in 1990s Manhattan.'))
2020-08-05 17:53:47,105 INFO sqlalchemy.engine.base.Engine COMMIT
CPU times: user 460 ms, sys: 28.1 ms, total: 488 ms
Wall time: 7.1 s

In [39]:
#Read first 10 values in table
engine.connect().execute(netflix_titles.select().limit(10)).fetchall()

2020-08-05 17:54:35,366 INFO sqlalchemy.engine.base.Engine SELECT netflix_titles.show_id, netflix_titles."type", netflix_titles.title, netflix_titles.director, netflix_titles."cast", netflix_titles.country, netflix_titles.date_added, netflix_titles.release_year, netflix_titles.rating, netflix_titles.duration, netflix_titles.listed_in, netflix_titles.description
FROM netflix_titles FETCH FIRST 10 ROWS ONLY
2020-08-05 17:54:35,368 INFO sqlalchemy.engine.base.Engine ()

[(81145628, 'Movie', 'Norm of the North: King Sized Adventure', 'Richard Finn, Tim Maltby', 'Alan Marriott, Andrew Toth, Brian Dobson, Cole Howard, Jennifer Cameron, Jonathan Holmes, Lee Tockar, Lisa Durupt, Maya Kay, Michael Dobson', 'United States, India, South Korea, China', 'September 9, 2019', 2019, 'TV-PG', '90 min', 'Children & Family Movies, Comedies', 'Before planning an awesome wedding for his grandfather, a polar bear king must take back a stolen artifact from an evil archaeologist first.'),
 (80117401, 'Movie', 'Jandino: Whatever it Takes', None, 'Jandino Asporaat', 'United Kingdom', 'September 9, 2016', 2016, 'TV-MA', '94 min', 'Stand-Up Comedy', 'Jandino Asporaat riffs on the challenges of raising kids and serenades the audience with a rousing rendition of "Sex on Fire" in his comedy show.'),
 (70234439, 'TV Show', 'Transformers Prime', None, 'Peter Cullen, Sumalee Montano, Frank Welker, Jeffrey Combs, Kevin Michael Richardson, Tania Gunadi, Josh Keaton, Steve Blum, Andy Pessoa, Ernie Hudson, Daran Norris, Will Friedle', 'United States', 'September 8, 2018', 2013, 'TV-Y7-FV', '1 Season', "Kids' TV", 'With the help of three human allies, the Autobots once again protect Earth from the onslaught of the Decepticons and their leader, Megatron.'),
 (80058654, 'TV Show', 'Transformers: Robots in Disguise', None, 'Will Friedle, Darren Criss, Constance Zimmer, Khary Payton, Mitchell Whitfield, Stuart Allan, Ted McGinley, Peter Cullen', 'United States', 'September 8, 2018', 2016, 'TV-Y7', '1 Season', "Kids' TV", 'When a prison ship crash unleashes hundreds of Decepticons on Earth, Bumblebee leads a new Autobot force to protect humankind.'),
 (80125979, 'Movie', '#realityhigh', 'Fernando Lebrija', 'Nesta Cooper, Kate Walsh, John Michael Higgins, Keith Powers, Alicia Sanz, Jake Borelli, Kid Ink, Yousef Erakat, Rebekah Graf, Anne Winters, Peter Gilroy, Patrick Davis', 'United States', 'September 8, 2017', 2017, 'TV-14', '99 min', 'Comedies', 'When nerdy high schooler Dani finally attracts the interest of her longtime crush, she lands in the cross hairs of his ex, a social media celebrity.'),
 (80163890, 'TV Show', 'Apaches', None, 'Alberto Ammann, Eloy Azorín, Verónica Echegui, Lucía Jiménez, Claudia Traisac', 'Spain', 'September 8, 2017', 2016, 'TV-MA', '1 Season', 'Crime TV Shows, International TV Shows, Spanish-Language TV Shows', 'A young journalist is forced into a life of crime to save his father and family in this series based on the novel by Miguel Sáez Carral.'),
 (70304989, 'Movie', 'Automata', 'Gabe Ibáñez', 'Antonio Banderas, Dylan McDermott, Melanie Griffith, Birgitte Hjort Sørensen, Robert Forster, Christa Campbell, Tim McInnerny, Andy Nyman, David Ryall', 'Bulgaria, United States, Spain, Canada', 'September 8, 2017', 2014, 'R', '110 min', 'International Movies, Sci-Fi & Fantasy, Thrillers', 'In a dystopian future, an insurance adjuster for a tech company investigates a robot killed for violating protocol and discovers a global conspiracy.'),
 (80164077, 'Movie', 'Fabrizio Copano: Solo pienso en mi', 'Rodrigo Toro, Francisco Schultz', 'Fabrizio Copano', 'Chile', 'September 8, 2017', 2017, 'TV-MA', '60 min', 'Stand-Up Comedy', 'Fabrizio Copano takes audience participation to the next level in this stand-up set while reflecting on sperm banks, family WhatsApp groups and more.'),
 (80117902, 'TV Show', 'Fire Chasers', None, None, 'United States', 'September 8, 2017', 2017, 'TV-MA', '1 Season', 'Docuseries, Science & Nature TV', "As California's 2016 fire season rages, brave backcountry firefighters race to put out the flames, protect homes and save lives in this docuseries."),
 (70304990, 'Movie', 'Good People', 'Henrik Ruben Genz', 'James Franco, Kate Hudson, Tom Wilkinson, Omar Sy, Sam Spruell, Anna Friel, Thomas Arnold, Oliver Dimsdale, Diana Hardcastle, Michael Jibson, Diarmaid Murtagh', 'United States, United Kingdom, Denmark, Sweden', 'September 8, 2017', 2014, 'R', '90 min', 'Action & Adventure, Thrillers', "A struggling couple can't believe their luck when they find a stash of money in the apartment of a neighbor who was recently murdered.")]

In [27]:
#Delete table
netflix_titles.drop(engine)

2020-08-05 17:44:32,615 INFO sqlalchemy.engine.base.Engine
DROP TABLE netflix_titles
2020-08-05 17:44:32,616 INFO sqlalchemy.engine.base.Engine ()
2020-08-05 17:44:32,692 INFO sqlalchemy.engine.base.Engine COMMIT

In [ ]:
#Close connection to database
engine.connect().close()